<?php
 

	$title = "О проекте";
	$current_menu1 = "current-menu-item current_page_item";
	include("templ/block_header.php"); 
	 
?>

<div id="edge">
<h1>О проекте</h1>
<p>Информационно-аналитическая система (ИАС),
	обеспечивающая возможность оперативного получения информации 
	о фактическом распределении студентов по кафедрам математического факультета
	для выполнения курсовых и выпускных квалификационных работ и подготовки
	сопровождающих этот процесс документов, предусмотренных номенклатурой дел кафедр и деканата.</p>
</div>
<div id="edge">
<h1>Основные функции</h1>
<p>Упрощение процедур, связанных с распределением и сдачей курсовых и выпускных квалификационных работ.</p>
<p>Формирование и ведение базы данных курсовых и выпускных квалификационных работ непосредственно на кафедрах факультета.</p>
<p>Возможность записи студента к одному из преподавателей, выбрав у него тему.</p>
<p>Возможность предоставления преподавателями списка тем с кратким описанием.</p>
<p>Возможность рецензентам выбирать работы и писать к ним рецензии.</p>
<p>Возможность руководства факультета и кафедр отслеживать своевременность сдачи выполненных работ.</p>
</div>
<div id="edge">
<h1>Разработчики</h1>
<p>Блеников Дмитрий</p>
<p>Мороз Евгений</p>
<p>Ермишин Валентин</p>
</div>
<?php include("templ/block_footer.php"); ?>	