<?php  ?>
<div id="edge"><h1>О проекте</h1>
			<p><b>IAS</b> представляет собой <i>информационный портал</i> <a href="http://www.petrsu.ru" target="_blank">Петрозаводского государственного университета</a>,
			обеспечивающий возможность оперативного получения информации о фактическом распределении студентов по
			кафедрам математического факультета для выполнения <a href="list.php"><i>курсовых и выпускных квалификационных работ</i></a> и подготовки сопровождающих
			этот процесс документов, предусмотренных номенклатурой дел кафедр и деканата.</p></div>
		